Repository: mukunku/ParquetViewer
Catalog: src/ParquetViewer/Resources/Errors.*.resx
Languages: tr

# CopyRawMetadataFailedErrorMessage
source: Failed to copy metadata to your clipboard. Save to a file instead?
tr: Metadayı panoya kopyalarken bir hata oluştu. Veriyi dosyaya kaydetmek ister miydiniz?

# CopyRawMetadataFailedErrorTitle
source: Copy error
tr: Kopyalama hatası

# FieldListGenerationError
source: Something went wrong while generating the field list.
tr: Alan listesi oluşturulurken bir hata oldu.

# FileAssociationFailedErrorMessageFormat
source: Something went wrong (Error code: {0}). Try running ParquetViewer as administrator and try again.
tr: Birşey ters gitti (Hata kodu: {0}). ParquetViewer'ı yönetici olarak çaliştırıp tekrar deneyin.

# FileAssociationFailedErrorTitle
source: File association failed
tr: Uzanti ilişkilendirmesi başarısız oldu

# GenericErrorMessage
source: Something went wrong
tr: Birşey ters gitti

# InvalidDateFormatErrorMessage
source: Invalid date format. Please refer to the documentation for valid date format specifiers.
tr: Geçersiz tarih formatı. Geçerli format dizeleri için lütfen dökümantasyona bakın.

# InvalidDateFormatErrorTitle
source: Invalid Date Format
tr: Geçersiz Tarih Formatı

# InvalidQueryErrorTitle
source: Invalid Query
tr: Geçersiz Sorgu

# MetadataReadErrorMessage
source: Something went wrong while reading the file's metadata.
tr: Dosyanın metadatasını okurken bir hata oluştu.

# MetadataReadErrorTitle
source: Metadata Error
tr: Metadata Hatası

# NestedListOfTypeNotSupportedMessageFormat
source: {0} of {1}s are currently unsupported
tr: {1} içeren {0} alanlar şu anda desteklenmiyor

# NoFieldsFoundErrorMessage
source: The selected file/folder doesn't have any fields.
tr: Seçilen dosya/klasör hiç alan içermiyor.

# NoFieldsFoundErrorTitle
source: No fields found
tr: Alan bulunamadı

# NoThriftMetadataAvailableErrorMessage
source: No Thrift metadata available
tr: Thrift metadata bulunamadı

# OpenFileNoLongerExistsErrorMessageFormat
source: The specified file/folder no longer exists: {0}Please try opening a new file or folder.
tr: Belirtilen dosya/klasör artık bulunamıyor: {0}Lütfen başka bir dosya veya klasör açın.

# ParquetSchemaReadErrorMessage
source: Could not read parquet schema.
tr: Parquet şeması okunamadı.

# SelectAtLeastOneFieldErrorMessage
source: Please select at least one field
tr: En az bir alan seçin

# SelectAtLeastOneFieldErrorTitle
source: Error
tr: Hata

# StructWithUnsupportedFieldErrorMessageFormat
source: Struct `{0}` contains unsupported field: `{1}`
tr: Struct `{0}` desteklenmeyen bir alan içeriyor: `{1}`

# TooManyColumnsXlsErrorMessageFormat
source: The .xls file format supports a maximum of {0} columns. Please try another file format or reduce the amount of columns you are exporting. Your columns: {1}
tr: .xls dosya formatı en fazla {0} sütun desteklemektedir. Lütfen farklı bir dosya tipi seçin veya kaydetmeye çalıştığınız alan sayısını azaltın. Alan sayınız: {1}

# TooManyColumnsErrorTitle
source: Too many columns
tr: Çok fazla sütun

# TooManyColumnsXlsxErrorMessageFormat
source: The .xlsx file format supports a maximum of {0} columns. Please try another file format or reduce the amount of columns you are exporting. Your columns: {1}
tr: .xlsx dosya formatı en fazla {0} sütun desteklemektedir. Lütfen farklı bir dosya tipi seçin veya kaydetmeye çalıştığınız alan sayısını azaltın. Alan sayınız: {1}

# UnknownFieldTypeErrorMessage
source: Unknown field type
tr: Bilinmeyen alan tipi

# ExportFailedErrorTitle
source: File export failed
tr: Dosyaya aktarım başarısız oldu

# NoValidParquetFilesFoundErrorMessage
source: No valid parquet files found in folder. Invalid parquet files:
tr: Geçerli parquet dosyası bulunamadı. Bulunan geçersiz dosyalar:

# SomeInvalidParquetFilesFoundErrorMessage
source: Some files could not be loaded. Invalid Parquet files:
tr: Bazı parquet dosyaları yüklenemedi. Bulunan geçersiz dosyalar:

# UnexpectedFileReadErrorMessageFormat
source: Could not load parquet file. If the problem persists please consider opening a bug ticket in the project repo: Help → About {0}
tr: Parquet dosyası okunamadı. Sorun devam ederse lütfen projenin GitHub repo'suna bildirmeyi düşünün: Yardım → Hakkında {0}

# MultipleSchemasDetectedErrorMessage
source: Multiple schemas detected.
tr: Birden fazla şema bulundu.

# MalformedFieldErrorMessageFormat
source: {0} If you think the file is valid please consider opening an issue in the GitHub repo. See: Help → About
tr: {0} Eğer dosyanın aslında geçerli olduğunu düşünüyorsanız lutfen projenin GitHub repo'sunda sorunu bildirin: Yardım → Hakkında

# DecimalValueTooLargeErrorTitle
source: Decimal value too large
tr: Decimal değeri çok büyük

# DecimalValueTooLargeErrorMessageFormat
source: Field `{0}` with type DECIMAL({1}, {2}) contains values outside ParquetViewer's supported range between DECIMAL({3}, {4}) and DECIMAL({3}, 0)
tr: DECIMAL({1}, {2}) tipli alan `{0}` ParquetViewer'ın desteklediği aralığın dışında bulunuyor: DECIMAL({3}, {4}) ve DECIMAL({3}, 0)

# MultipleSchemasDetectedEntriesErrorMessageFormat
source: SCHEMA-{0} FIELDS (TOP 5):
tr: ŞEMA-{0} ALANLARI (TOP 5):

# CopyAsWhereTooLargeErrorMessage
source: The selected data is too large. Please select less cells.
tr: Çok fazla veri seçili. Lütfen daha az hücre seçin.

# CopyAsWhereTooLargeErrorTitle
source: Copy to clipboard failed
tr: Panoya kopyalama başarısız oldu

# InvalidQueryErrorMessage
source: The query doesn't seem to be valid. Please try again.
tr: Sorgu geçerli gözükmüyor.

# UnexpectedAssemblyVersionErrorFormat
source: An unexpected assembly version was encountered: {0}
tr: Beklenmedik bir program sürümü ile karşılaşıldı: {0}
