Repository: mukunku/ParquetViewer
Catalog: src/ParquetViewer/Resources/Strings.*.resx
Languages: tr

# LoadingDataLabelText
source: Loading Data
tr: Veri Yükleniyor

# CancelInitiatedLabelText
source: Cancelling...
tr: İptal ediliyor...

# ExportingDataLabelText
source: Exporting Data
tr: Veri Aktarılıyor

# IndexingDataLabelText
source: Indexing
tr: Dizinleniyor

# PrivacyPolicyLabelText
source: Privacy policy
tr: Gizlilik politikası

# InvalidDateFormatErrorText
source: invalid date format
tr: geçersiz tarih formatı

# TooManyFieldsErrorFormat
source: Too many fields: {0}
tr: Desteklenmeyen sayıda alan: {0}

# UnsupportedFieldCountTextFormat
source: Unsupported: {0}
tr: Desteklenmeyen: {0}

# SelectAllCheckmarkTextFormat
source: Select All (Count: {0})
tr: Hepsini Seç (Sayı: {0})

# DeselectAllCheckmarkTextFormat
source: Deselect All (Count: {0})
tr: Seçimleri Kaldır (Sayı: {0})

# UnsupportedFieldText
source: (Unsupported)
tr: (Desteklenmiyor)

# ThriftMetadataCopiedToClipboardMessage
source: Raw Thrift metadata copied to clipboard.
tr: Ham Thrift metadatası panoya kopyalandı.

# SaveRawMetadataToFileDialogTitle
source: Save raw metadata
tr: Ham metadatayı kaydet

# MetadataSuccessfullyExportedToFileMessageFormat
source: Metadata successfully exported to: {0}
tr: Metadata başarıyla kaydedildi: {0}

# MetadataSuccessfullyExportedToFileMessageTitle
source: Export complete
tr: Kayıt başarılı

# MainWindowOpenFileTitleFormat
source: File: {0}
tr: Dosya: {0}

# MainWindowOpenFolderTitleFormat
source: Folder: {0}
tr: Klasör: {0}

# QuerySyntaxHelpText
source: NULL CHECK: WHERE field_name IS NULL WHERE field_name IS NOT NULL DATETIME: WHERE field_name >= #2000-12-31# WHERE field_name = #2000-01-13 01:00:00# NUMERIC: WHERE field_name <= 123.4 WHERE (field1 * field2) / 100 > 0.1 STRING: WHERE field_name LIKE '%value%' WHERE field_name = 'equals value' WHERE field_name <> 'not equals' IN CHECK: WHERE field_name IN (value1, value2) WHERE field_name NOT IN (value3, value4) MULTIPLE CONDITIONS: WHERE (field_1 = 0 AND field_2 <> 'value') OR field_3 IS NULL Checkout 'Help → User Guide' for more information.
tr: NULL KONTROLÜ: WHERE field_name IS NULL WHERE field_name IS NOT NULL TARİH ve ZAMAN: WHERE field_name >= #2000-12-31# WHERE field_name = #2000-01-13 01:00:00# SAYISAL: WHERE field_name <= 123.4 WHERE (field1 * field2) / 100 > 0.1 METİN: WHERE field_name LIKE '%value%' WHERE field_name = 'equals value' WHERE field_name <> 'not equals' IN KONTROLÜ: WHERE field_name IN (value1, value2) WHERE field_name NOT IN (value3, value4) BIRDEN FAZLA KOŞUL: WHERE (field_1 = 0 AND field_2 <> 'value') OR field_3 IS NULL Daha fazla bilgi için 'Hakkında → Kullanıcı Kılavuzu' una goz atın.

# QuerySyntaxHelpTitle
source: Filter Query Syntax Examples
tr: Sorgu Filtresi Söz Dizim Örnekleri

# RecordsToBeExportedTitleFormat
source: {0} records will be exported
tr: {0} kayıt kaydedilecektir

# ExportCancelledMessage
source: Export has been cancelled
tr: Dosyaya kayıt işlemi iptal edilmiştir

# ExportCancelledTitle
source: Export Cancelled
tr: Aktarma İptal Edildi

# ExportSuccessfulMessageFormat
source: Export successful! File size: {0} MB
tr: Sonuçlar başarıyla kaydedildi! Dosya boyutu: {0} MB

# ExportSuccessfulTitle
source: Success
tr: Aktarma başarılı

# SwitchFromXlsToXlsxMessageFormat
source: Maximum {0} characters per cell are supported for {1} files. Would you like to switch to a {2} file instead?
tr: {1} dosyaları hücre başına maksimum {0} karakter desteklemektedir. Onun yerine sonuçlari {2} dosyasına aktarmak ister misiniz?

# SwitchFromXlsToXlsxMessageTitle
source: Data too large - Switch export type?
tr: Fazla uzun veri - Dosya tipi değiştirilsin mi?

# CreateTableScriptCopiedToClipboardMessage
source: Create table script copied to clipboard!
tr: Create table sorgusu panoya kopyalandı!

# CreateTableScriptFailedWithNoFieldsMessage
source: Please select some fields first to get the SQL script
tr: SQL sorgusunu yaratmak için lütfen önce birkaç alan seçin

# CopyToClipboardText
source: Copy
tr: Kopyala

# CancelButtonText
source: Cancel
tr: İptal Et

# CopyToClipboardWithHeadersText
source: Copy with headers
tr: Başlıklarla kopyala

# CopyAsWhereConditionText
source: Copy as WHERE...
tr: WHERE olarak kopyala

# DecimalScientificFormatting
source: Scientific
tr: Bilimsel

# DimensionsText
source: Dimensions
tr: Boyutlar

# TypeText
source: Type
tr: Format

# SaveImageToFileButtonTextFormat
source: Save as {0}
tr: {0} olarak Kaydet

# CantGoBackLinkButtonText
source: can't go back
tr: geri gidilemiyor

# SaveImageAsButtonText
source: Save image as {0}
tr: Resmi {0} olarak kaydet

# ImageSavedToDiskMessage
source: Image saved to {0}
tr: Görüntü kaydedildi: {0}

# ImageSavedToDiskTitle
source: Save complete
tr: Kayıt tamamlandı
