Repository: mukunku/ParquetViewer
Catalog: src/ParquetViewer/CustomDateFormatInputForm.*.resx
Languages: tr

# livePreviewTextBox.PlaceholderText
source: 👈🏽 Start typing to preview your date format
tr: 👈🏽 Önizleme için yazmaya başlayın

# label56.Text
source: Live preview:
tr: Canlı önizleme

# label33.Text
source: The year as a four-digit number.
tr: Yıl, dört basamaklı sayı olarak

# label27.Text
source: The year, from 00 to 99.
tr: Yıl, 00'dan 99'a.

# label21.Text
source: The month, from 01 to 12.
tr: Ay, 01'den 12'ye

# label15.Text
source: The month, from 1 to 12.
tr: Ay, 1'den 12'ye.

# label9.Text
source: The day of the month, from 01 to 31.
tr: Ayın günü 01'den 31'e.

# label3.Text
source: The day of the month, from 1 to 31.
tr: Ayın günü 1'den 31'e.

# label38.Text
source: Format specifier
tr: Format karakteri

# label39.Text
source: Description
tr: Açıklama

# label40.Text
source: Examples
tr: Örnekler

# label6.Text
source: The second, from 0 to 59.
tr: Saniye, 0'dan 59'a.

# label12.Text
source: The second, from 00 to 59.
tr: Saniye, 00'dan 59'a.

# label18.Text
source: The minute, from 0 to 59.
tr: Dakika, 0'dan 59'a.

# label24.Text
source: The minute, from 00 to 59.
tr: Dakika, 00'dan 59'a.

# label30.Text
source: The hour, using a 12-hour clock from 01 to 12.
tr: Saat, 12-saatlik dilimler 01'den 12'ye.

# label36.Text
source: The hour, using a 24-hour clock from 00 to 23.
tr: Saat, 24-saatlik dilim 00'dan 23'e.

# label48.Text
source: The milliseconds in a date and time value.
tr: Zamanlı tarihlerdeki milisaniye değeri

# label54.Text
source: The ten millionths of a second in a date and time.
tr: Zaman değerindeki saniyenin on milyonda biri

# label45.Text
source: The AM/PM designator.
tr: AM/PM belirteci.

# dateFormatDocsLinkLabel.Text
source: Click here to see all format specifiers
tr: Tüm format karakterleri için buraya tıklayın

# label1.Text
source: Enter your desired date format:
tr: Dilediğiniz tarih formatını girin:

# desiredDateFormatTextBox.PlaceholderText
source: E.g. yyyy-MM-dd hh:mm:ss tt
tr: Örnek: yyyy-MM-dd hh:mm:ss tt

# saveDateFormatButton.Text
source: Save
tr: Kaydet

# $this.Text
source: ParquetViewer - Date Format Configuration
tr: ParquetViewer - Tarih Formatı Ayarı
